# 格式化字符串

print(f'\n{"*" * 20}')
# 填充字符、对齐方式
print(f'{"hello world":.>20}') # .........hello world

print(f'\n{"*" * 20}')
# 针对数字，正、负符号
print(f'{100:+}')   # +100
print(f'{-100:+}')  # -100
print(f'{100:-}')   # 100
print(f'{-100:-}')  # -100

print(f'\n{"*" * 20}')
# 字符串宽度
print(f'{"":@>20}') # @@@@@@@@@@@@@@@@@@@@
print(f'{8:0>4}')   # 0008

print(f'\n{"*" * 20}')
# 小数位数
print(f'{0.1:.4f}') # 0.1000

print(f'\n{"*" * 20}')
# 数据类型
print(f'{6.66:.4f}')    # 6.6600
print(f'{0.82:.0%}')    # 82%
print(f'{0.82:.2%}')    # 82.00%
